<template>
  <div class="agreement clearfix" data-title="用户注册协议" data-url="" data-right="">
    <p>本协议由您与青岛指尖秀科技有限公司有限公司（以下简称“指尖秀科技”）共同缔结，本协议具有合同效力。</p>
    <p>本协议中协议双方合称协议方，指尖秀科技有限公司在协议中亦称为“指尖秀科技”。</p>
    <p>一、协议内容及签署</p>
    <p>1.本协议内容包括协议正文及所有指尖秀科技已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何指尖秀科技及其关联公司提供的服务（以下称为指尖秀科技服务）均受本协议约束。</p>
    <p>2.您应当在使用指尖秀科技服务之前认真阅读全部协议内容，对于协议中以加粗字体显示的内容，您应重点阅读。如您对协议有任何疑问的，应向指尖秀科技咨询。但无论您事实上是否在使用指尖秀科技服务之前认真阅读了本协议内容，只要您使用指尖秀科技服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得指尖秀科技对您问询的解答等为理由，主张本协议无效，或要求撤销本协议。</p>
    <p>3.您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用指尖秀科技服务。</p>
    <p>4. 指尖秀科技有权根据需要不时地制订、修改本协议及各类规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在网站公布后，立即自动生效。如您不同意相关变更，应当立即停止使用指尖秀科技服务。若您继续使用指尖秀科技服务，即表示您接受经过修订的协议。</p>
    <p>二、注册</p>
    <p>1.注册者资格</p>
    <p>您确认，在您完成注册程序或以其他指尖秀科技允许的方式实际使用指尖秀科技服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且指尖秀科技有权注销（永久冻结）您的指尖秀科技账户，并向您及您的监护人索偿。</p>
    <p>2.账户</p>
    <p>在您签署本协议，完成会员注册程序或以其他指尖秀科技允许的方式实际使用指尖秀科技服务时，指尖秀科技会向您提供唯一编号的指尖秀科技账户（以下亦称账户）。</p>
    <p>您可以对账户设置密码，通过该会员密码或与该会员密码关联的其它用户名密码登录指尖秀科技。您设置的资料不得侵犯或涉嫌侵犯他人合法权益。当您的账户设立完成后，您应当在此后90日内使用您的会员号和密码登录指尖秀科技。逾期未登录的，指尖秀科技有权终止向您提供指尖秀科技服务，注销您的账户。账户注销后，相应的会员号将开放给任意用户注册登记使用。</p>
    <p>您应对您的账户（会员号）和密码的安全，以及对通过您的账户（会员号）和密码实施的行为负责。除非有法律规定或司法裁定，且征得指尖秀科技的同意，否则，账户（会员号）和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。如果发现任何人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以有效方式通知指尖秀科技，要求指尖秀科技暂停相关服务。您理解指尖秀科技通对您的请求采取行动需要合理时间，指尖秀科技对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</p>
    <p>为方便您使用指尖秀科技服务及指尖秀科技关联公司或其他组织的服务（以下称其他服务），您同意并授权指尖秀科技将您在注册、使用指尖秀科技服务过程中提供、形成的信息传递给向您提供其他服务的指尖秀科技关联公司或其他组织，或从提供其他服务的指尖秀科技关联公司或其他组织获取您在注册、使用其他服务期间提供、形成的信息。</p>
    <p>3.会员</p>
    <p>在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他指尖秀科技允许的方式实际使用指尖秀科技服务时，您即成为指尖秀科技会员。</p>
    <p>在注册时，您应当按照法律法规要求，或注册页面的提示准确提供，并及时更新您的资料，以使之真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，指尖秀科技有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至终止对您提供部分或全部指尖秀科技服务。指尖秀科技对此不承担任何责任，您将承担因此产生的任何直接或间接支出。</p>
    <p>您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便指尖秀科技或其他会员与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用指尖秀科技服务过程中产生任何损失或增加费用的，应由您完全独自承担。</p>
    <p>您在使用指尖秀科技服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。</p>
    <p>三、指尖秀科技服务</p>
    <p>1.通过指尖秀科技及其关联公司提供的指尖秀科技服务和其它服务，会员可在指尖秀科技上查询商家和服务信息、达成消费意向并进行实际消费、对其他会员进行评价、参加指尖秀科技组织的活动以及使用其它信息服务及技术服务。</p>
    <p>2.您通过在指尖秀科技的消费过程中与其他会员、联盟商家发生消费纠纷时，一旦您或其它会员、商家任一方或双方共同提交指尖秀科技要求调处，则指尖秀科技有权根据单方判断做出调处决定，您了解并同意接受指尖秀科技的判断和调处决定。该决定将对您具有法律约束力。</p>
    <p>3.您了解并同意，指尖秀科技有权应政府部门（包括司法及行政部门）的要求，向其提供您在指尖秀科技填写的注册信息和交易纪录等必要信息。如您涉嫌侵犯他人知识产权，则指尖秀科技亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</p>
    <p>四、指尖秀科技服务使用规范</p>
    <p>1.通过指尖秀科技使用指尖秀科技服务过程中，您承诺遵守以下约定：</p>
    <p>a) 在使用指尖秀科技服务过程中实施的所有行为均遵守国家法律、法规等规范性文件及指尖秀科技各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保指尖秀科技免于因此产生任何损失。</p>
    <p>b) 在与其他会员交易过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。</p>
    <p>c) 不发布国家禁止销售的或限制销售的商品或服务信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的商品或服务信息，不发布违背社会公共利益或公共道德或指尖秀科技认为不适合在指尖秀科技平台上销售的商品或服务信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。</p>
    <p>d) 不以虚构或歪曲事实的方式不当评价其他会员，不采取不正当方式制造或提高自身的信用度，不采取不正当方式制造或提高（降低）其他会员的信用度；</p>
    <p>e) 不对指尖秀科技的任何数据作商业性利用，包括但不限于在未指尖秀科技通事先书面同意的情况下，以复制、传播等任何方式使用指尖秀科技网站上展示的资料。</p>
    <p>f) 不使用任何装置、软件或例行程序干预或试图干预指尖秀科技的正常运作或正在指尖秀科技上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸指尖秀科技网络设备的行动。</p>
    <p>2.您了解并同意：</p>
    <p>a) 指尖秀科技有权对您是否违反上述承诺做出单方认定，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。</p>
    <p>b) 经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者指尖秀科技根据自身的判断，认为您的行为涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，则指尖秀科技有权在指尖秀科技上公示您的该等涉嫌违法或违约行为及指尖秀科技已对您采取的措施。</p>
    <p>c) 对于您在指尖秀科技上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，指尖秀科技有权不经通知您即予以删除，且按照规则的规定进行处罚。</p>
    <p>d) 对于您在指尖秀科技上实施的行为，包括您未在指尖秀科技上实施但已经对指尖秀科技及其用户产生影响的行为，指尖秀科技有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并据此作出相应处罚。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。</p>
    <p>e) 对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保指尖秀科技免于因此产生损失或增加费用。</p>
    <p>f) 如您涉嫌违反有关法律或者本协议之规定，使指尖秀科技遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿指尖秀科技因此造成的损失及（或）发0生的费用，包括合理的律师费用。</p>
    <p>五、 特别授权</p>
    <p>您完全理解并不可撤销地授予指尖秀科技及其关联公司下列权利：</p>
    <p>1.一旦您向指尖秀科技及（或）其关联公司（包括联盟商家）等作出任何形式的承诺，且相关公司已确认您违反了该承诺，则指尖秀科技有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，指尖秀科技无须就相关确认与您核对事实，或另行征得您的同意，且指尖秀科技无须就此限制措施或公示行为向您承担任何的责任。</p>
    <p>2.一旦您违反本协议，或与指尖秀科技签订的其他协议的约定，指尖秀科技有权以任何方式通知指尖秀科技关联公司，要求其对您的权益采取限制措施，包括将您账户内的款项支付给指尖秀科技指定的对象，要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。</p>
    <p>3.对于您提供的资料及数据信息，您授予指尖秀科技及其关联公司独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)。此外，指尖秀科技及其关联公司有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于指尖秀科技的各类信息）或制作其派生作品，并以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。</p>
    <p>六、责任范围和责任限制</p>
    <p>1. 指尖秀科技负责按"现状"和"可得到"的状态向您提供指尖秀科技服务。但指尖秀科技对指尖秀科技服务不作任何明示或暗示的保证，包括但不限于指尖秀科技服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，指尖秀科技也不对指尖秀科技服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。</p>
    <p>2.您了解指尖秀科技上的信息系用户自行发布，且可能存在风险和瑕疵。指尖秀科技仅作为信息交流平台。指尖秀科技仅作为沟通您与商家的一个平台、一座桥梁，但指尖秀科技无法控制消费所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及消费各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关物品及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。</p>
    <p>3.除非法律法规明确要求，或出现以下情况，否则，指尖秀科技没有义务对所有用户的注册数据、商品（服务）信息、交易行为以及与交易有关的其它事项进行事先审查：</p>
    <p>a) 指尖秀科技有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形。</p>
    <p>b) 指尖秀科技有合理的理由认为用户在指尖秀科技网上的行为涉嫌违法或不当。</p>
    <p>4. 指尖秀科技其关联公司有权受理您与商家因消费产生的争议，并有权判断与该争议相关的事实及应适用的规则，进而作出处理决定。该处理决定对您有约束力。如您在商家消费未能正常支付，指尖秀科技在与您、商家确定真实数据后，有权通过系统后台扣除您该支付的款项给商家。</p>
    <p>您理解并同意，指尖秀科技及其关联公司并非司法机构，仅能以普通人的身份对证据进行鉴别指尖秀科技及其关联公司对争议的调处完全是基于您的委托，指尖秀科技及其关联公司无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。</p>
    <p>5.您了解并同意，指尖秀科技不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论指尖秀科技是否已被告知该等损害赔偿的可能性) ：</p>
    <p>a) 使用或未能使用指尖秀科技服务。</p>
    <p>b) 第三方未经批准的使用您的账户或更改您的数据。</p>
    <p>c) 通过指尖秀科技服务购买或获取任何商品、样品、数据、信息或进行交易等行为或替代行为产生的费用及损失。</p>
    <p>d) 您对指尖秀科技服务的误解。</p>
    <p>e) 任何非因指尖秀科技的原因而引起的与指尖秀科技服务有关的其它损失。</p>
    <p>6.不论在何种情况下，指尖秀科技均不对由于互联网正常的设备维护，互联网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。</p>
    <p>七、 协议终止</p>
    <p>1.您同意，指尖秀科技有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部指尖秀科技网服务，暂时冻结或永久冻结（注销）您的账户，且无须为此向您或任何第三方承担任何责任。</p>
    <p>2.出现以下情况时，指尖秀科技有权直接以注销账户的方式终止本协议:</p>
    <p>a) 指尖秀科技终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为指尖秀科技用户的；</p>
    <p>b) 您提供的手机号、电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与您进行联系，或指尖秀科技以其它联系方式通知您更改手机号，而您在指尖秀科技通知后三个工作日内仍未更改为有效的手机号的。</p>
    <p>c) 您注册信息中的主要内容不真实或不准确或不及时或不完整。</p>
    <p>d) 本协议（含规则）变更时，您明示并通知指尖秀科技不愿接受新的服务协议的；</p>
    <p>e) 其它指尖秀科技认为应当终止服务的情况。</p>
    <p>3.您有权向指尖秀科技要求注销您的账户，经指尖秀科技审核同意的，指尖秀科技注销（永久冻结）您的账户，届时，您与指尖秀科技基于本协议的合同关系即终止。您的账户被注销（永久冻结）后，指尖秀科技没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</p>
    <p>4.您同意，您与指尖秀科技的合同关系终止后，指尖秀科技仍享有下列权利</p>
    <p>a) 继续保存您的注册信息及您使用指尖秀科技誉服务期间的所有消费信息。</p>
    <p>b) 您在使用指尖秀科技服务期间存在违法行为或违反本协议和/或规则的行为的，指尖秀科技仍可依据本协议向您主张权利。</p>
    <p>八、隐私权政策</p>
    <p>指尖秀科技将在指尖秀科技网上公布并不时修订隐私权政策，隐私权政策构成本协议的有效组成部分。</p>
    <p>九、法律适用、管辖与其他</p>
    <p>1.本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。</p>
    <p>2.因本协议产生之争议，应依照中华人民共和国法律予以处理，并以指尖秀科技所在地的人民法院为第一审管辖法院。</p>
  </div>
</template>

<script>
export default {
  name: 'registrationAgreement',
  data () {
    return {
    };
  },
  mounted: function () {
    this.getHeader('注册协议');  // 第一个参数：header名字；第二个参数：添加的class类名；第三个参数：header右边的名字
  },
  methods: {
  }
};
</script>
<style lang="scss">

  .agreement {
    padding: 110px 0 ;
    padding-bottom: 10px;
    p {
      font-size: 22px;
      line-height: 40px;
      text-align: justify;
      color: #666;
      padding: 0 20px;
      width: 100%;
      float: right;
      &.title {
        color: #000;
        padding-top: 10px;
      }
    }
  }
</style>
